<center><h3>Pandas Fundaments form IIT Nepal</h3></center>
<img src="https://iitnepal.edu.np/wp-content/themes/iit/images/logo-colorful.svg" style="height:100px;width:auto;">
<center><h4>Contact us: 9851161198/9851224985 for different IT professional program in this pandemic throguh online in 50% discount</h4></center>

In [2]:
import pandas as pd

### Series

In [3]:
a= pd.Series([4,7,3])

In [4]:
a

0    4
1    7
2    3
dtype: int64

In [5]:
a.values

array([4, 7, 3], dtype=int64)

In [8]:
list(a.index)

[0, 1, 2]

In [12]:
x =pd.Series([4,7,3],index=['a','b','c'])

In [10]:
x

a    4
b    7
c    3
dtype: int64

In [13]:
x['a']

4

In [ ]:
x['a']

In [14]:
x[['a','c']]

a    4
c    3
dtype: int64

##### convert the python dict to series

In [15]:
sdata = {'a':10,'b':30,'c':12}

In [16]:
s = pd.Series(sdata)

In [17]:
s

a    10
b    30
c    12
dtype: int64

In [18]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [19]:
data =[1,2,3,4,5]

In [20]:
df = pd.DataFrame(data)

In [21]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [22]:
data =[['Alex',10],['Bob',12],['Clarke',23]]

In [23]:
df = pd.DataFrame(data)

In [24]:
df

        0   1
0    Alex  10
1     Bob  12
2  Clarke  23

In [25]:
data =[['Alex',10],['Bob',12],['Clarke',23]]

In [32]:
df = pd.DataFrame(data,columns=['Name','Age'])

In [41]:
data ={'Name':['Alex','Bob','Clarke'],'Age':[10,12,23]}

In [42]:
df = pd.DataFrame(data)

In [43]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   23

In [44]:
data ={'Name':['Alex','Bob','Clarke'],'Age':[10,12,23]}
df = pd.DataFrame(data,index=['a','b','c'])
print(df)

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   23

In [46]:
data = [{'a':10,'b':20,'c':30},{'a':12,'b':34,'c':23},{'a':33,'b':334,'c':11}]
df = pd.DataFrame(data)
df

    a    b   c
0  10   20  30
1  12   34  23
2  33  334  11

#### Creating data from series

In [53]:
d = {
    'one':pd.Series([1,2,3,5],index=['a','b','c','d']),
    'two':pd.Series([2,3,4],index=['b','c','d'])
}

In [54]:
df = pd.DataFrame(d)

In [55]:
df

   one  two
a    1  NaN
b    2  2.0
c    3  3.0
d    5  4.0

##### Column

In [56]:
df['one']

a    1
b    2
c    3
d    5
Name: one, dtype: int64

### Column addition

In [57]:
df['three'] = pd.Series([111,222,333],index=['a','b','c'])

In [58]:
df

   one  two  three
a    1  NaN  111.0
b    2  2.0  222.0
c    3  3.0  333.0
d    5  4.0    NaN

In [59]:
df['four']=df['one']+df['two']

In [60]:
df

   one  two  three  four
a    1  NaN  111.0   NaN
b    2  2.0  222.0   4.0
c    3  3.0  333.0   6.0
d    5  4.0    NaN   9.0

In [61]:
del df['three']

In [62]:
df

   one  two  four
a    1  NaN   NaN
b    2  2.0   4.0
c    3  3.0   6.0
d    5  4.0   9.0

In [63]:
df.pop('four')

a    NaN
b    4.0
c    6.0
d    9.0
Name: four, dtype: float64

In [64]:
df

   one  two
a    1  NaN
b    2  2.0
c    3  3.0
d    5  4.0

<center><h3>Numpy Fundaments form IIT Nepal</h3></center>
<img src="https://iitnepal.edu.np/wp-content/themes/iit/images/logo-colorful.svg" style="height:100px;width:auto;">
<center><h4>Contact us: 9851161198/9851224985 for different IT professional program in this pandemic throguh online in 50% discount</h4></center>

#### addition of rows

In [65]:
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]],columns=['a','b'])

In [66]:
df

   a  b
0  1  2
1  3  4

In [67]:
df2

   a  b
0  5  6
1  7  8

In [68]:
df = df.append(df2)

In [69]:
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [ ]:
df

In [72]:
data = [{'a':10,'b':20,'c':30},{'a':12,'b':34,'c':23},{'a':33,'b':334,'c':11}]
df = pd.DataFrame(data)

In [73]:
df

    a    b   c
0  10   20  30
1  12   34  23
2  33  334  11

In [74]:
df.sum() axis=0, axis=1

a     55
b    388
c     64
dtype: int64

In [75]:
df.sum(axis=1)

0     60
1     69
2    378
dtype: int64

In [77]:
df.mean(axis=0)

a     18.333333
b    129.333333
c     21.333333
dtype: float64

In [78]:
df.mean(axis=1)

0     20.0
1     23.0
2    126.0
dtype: float64

In [79]:
df.std()

a     12.741010
b    177.384704
c      9.609024
dtype: float64

In [80]:
df.std(axis=1)

0     10.000000
1     11.000000
2    180.468834
dtype: float64

In [81]:
df.describe()

               a           b          c
count   3.000000    3.000000   3.000000
mean   18.333333  129.333333  21.333333
std    12.741010  177.384704   9.609024
min    10.000000   20.000000  11.000000
25%    11.000000   27.000000  17.000000
50%    12.000000   34.000000  23.000000
75%    22.500000  184.000000  26.500000
max    33.000000  334.000000  30.000000